In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
from sqlalchemy import create_engine

In [3]:
connection = "mysql+pymysql://root:Londo105@localhost/sakila"

In [4]:
engine = create_engine(connection)

In [5]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [10]:
q = """SELECT * FROM customer;"""
pd.read_sql(q, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 12:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 12:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 12:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-14 12:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 12:57:20
...,...,...,...,...,...,...,...,...,...
594,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,1,2006-02-14 22:04:37,2006-02-14 12:57:20
595,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,1,2006-02-14 22:04:37,2006-02-14 12:57:20
596,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,1,2006-02-14 22:04:37,2006-02-14 12:57:20
597,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,1,2006-02-14 22:04:37,2006-02-14 12:57:20
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,1,2006-02-14 22:04:37,2006-02-14 12:57:20

In [11]:
q = """SELECT * FROM city;"""
pd.read_sql(q, engine)

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-14 12:45:25
1          2                Abha          82 2006-02-14 12:45:25
2          3           Abu Dhabi         101 2006-02-14 12:45:25
3          4                Acua          60 2006-02-14 12:45:25
4          5               Adana          97 2006-02-14 12:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-14 12:45:25
596      597        Zeleznogorsk          80 2006-02-14 12:45:25
597      598         Zhezqazghan          51 2006-02-14 12:45:25
598      599            Zhoushan          23 2006-02-14 12:45:25
599      600          Ziguinchor          83 2006-02-14 12:45:25

[600 rows x 4 columns]

In [ ]:
# 1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [12]:
q = "SELECT customer.first_name, customer.last_name, customer.email, address.address, city.city
FROM customer
JOIN city, address
ON city.city_id = address.city_id and address.address_id = customer.address_id
WHERE city.city_id = '312';"
pd.read_sql(q, engine)

SyntaxError: EOL while scanning string literal (369080624.py, line 1)

In [ ]:
# 2. What query would you run to get all comedy films? Note that the genre is called the category in this schema.  Your query should return film title, description, release year, rating, and special features.

In [ ]:
SELECT film.title, film.description, film.release_year, film.rating, film.special_features
FROM film
JOIN film_category, category
ON film.film_id = film_category.film_id and film_category.category_id = category.category_id
WHERE category.name = "Comedy";

In [ ]:
# 3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [ ]:
SELECT actor.last_name, film.title, film.release_year
FROM film
JOIN film_category, film_actor
ON film.film_id = film_actor.film_id and film_actor.actor_id = actor.actor_id
WHERE actor.last_name = "Lollobrigida";

In [ ]:
# # 4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [ ]:
SELECT actor.first_name, actor.last_name
FROM actor
JOIN film, film_actor
ON actor.actor_id = film_actor.actor_id and film.film_id = film_actor.film_id
WHERE film.title = "Bingo Talented";

In [ ]:
# 5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [ ]:
SELECT customer_id
FROM customer 
JOIN payment
ON customer.customer_id = payment.customer_id
WHERE payment.amount >
			(SELECT 2*AVG(payment)
            FROM payment);

In [ ]:
# 6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [ ]:
 SELECT customer.first_name, customer.last_name
 JOIN payment
  (SELECT COUNT(*)
   FROM payment.amount
   WHERE customer.customer_id = payment.customer_id) AS num_payments
FROM payment
ORDER by num_payment DESC;